S1Сtest/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
</mdclass:Catalog>

S1Сtest/src/CommonModules/Пользователи/Module.bsl
Функция НайтиСоздатьПользователя(ПользовательИБ) Экспорт
	
	Если Не ТипЗнч(ПользовательИБ) = Тип("ПользовательИнформационнойБазы") Тогда
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторПользователяИБ", ПользовательИБ.УникальныйИдентификатор);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		ПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();
		Если ЗначениеЗаполнено(ПользовательИБ.Имя) Тогда
			ИмяПользователя = ПользовательИБ.Имя;
		Иначе
			ИмяПользователя = "<Не указан>";
		КонецЕсли;
		ПользовательОбъект.Наименование					= ИмяПользователя;
		ПользовательОбъект.ПолноеИмя					= ПользовательИБ.ПолноеИмя;
		ПользовательОбъект.ИдентификаторПользователяИБ	= ПользовательИБ.УникальныйИдентификатор;
		ПользовательОбъект.Записать();
		Возврат ПользовательОбъект.Ссылка;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции
